# 1. Парсинг аргументів. Скрипт приймає два аргументи командного рядка: шлях до вихідної директорії та шлях до
# директорії призначення (за замовчуванням, якщо тека призначення не була передана, вона повинна бути з назвою dist).

# 2. Рекурсивне читання директорій:
# Написана функція, яка приймає шлях до директорії як аргумент.
# Функція перебирає всі елементи у директорії.
# Якщо елемент є директорією, функція викликає саму себе рекурсивно для цієї директорії.
# Якщо елемент є файлом, він є обробленим для копіювання.

# 3. Копіювання файлів:
# Для кожного типу файлів створюється новий шлях у вихідній директорії, використовуючи
# розширення файлу для назви піддиректорії.
# Файл з відповідним типом копіюється у відповідну піддиректорію.

# 4. Обробка винятків: код обробляє винятки, наприклад, помилки доступу до файлів або директорій.

# 5. Після виконання програми всі файли у вихідній директорії рекурсивно скопійовано в нову
# директорію та розсортовано в піддиректорії за їх розширенням.
