# У багатьох мовах програмування ми маємо справу з виразами, виділеними символами-розділювачами,
# такими як круглі ( ), квадратні [ ] або фігурні дужки { }.

# Напишіть програму, яка читає рядок з послідовністю символів-розділювачів, наприклад, ( ) { [ ] ( ) ( ) { } } },
# і надає відповідне повідомлення, коли розділювачі симетричні, несиметричні, наприклад ( ( ( ) ,
# або коли розділювачі різних видів стоять у парі, як-от ( }.

# Приклад
# ( ){[ 1 ]( 1 + 3 )( ){ }}: Симетрично
# ( 23 ( 2 - 3);: Несиметрично
# ( 11 }: Несиметрично

